

var product = [{
    id: 1,
    day: '18/12/65',
    name: 'fa-solid fa-face-sad-cry',
    detail: 'hi',
    description:'ไง วันแรกของการเป็นพี่น้อง;-; กะทันหันชิบ พึ่งบอกไมร่าเองว่า"เราไม่มีความคิดว่าจะเลิกกับแตม เราแค่แบบ อยากทำให้ความสัมพันธ์ในตอนนี้ ให้มันดีขึ้นไป" แต่ช่างเถอะทำตัวเองล้วนๆ55555 แต่ก็นะที่ผ่านมาไมร่าแนะนำเราเยอะมากกก แต่เพราะเราอีโก้สูงมั้ง เลยทำให้ไม่ฟัง เมื่อคืนก็นอนไม่หลับเลยแบบสะดุ้งตื่นเกือบทุกชม.อะ555 ตื่นมาก็หกโมงกว่าๆ แล้วก็ถามแจ๊นว่า เราจะสามารถเปลี่ยนตัวเองแล้วจีบเทอได้อีกหรือป่าว ส่วนคำตอบก้ไม่ แจ๊นตอบมาประมาณแปดโมงนิดๆ หลังจากนั้นก็โทรคุยกันสักพักเลย พอวางสายปุ๊บ ก็ไปโพสต์รูปในPV สักพักเทอกดใจให้โคตรๆๆๆๆๆดีใจ555 แล้วก็ทักไปหาเซินต่อ ก็แบบช่วยเล่นเกม ละคุยกันได้ เราโดนด่ายับเลย5555 เล่นกันตอนสิบโมง ถึง สิบเอ็ดโมง ไอเชี่ยนั้น ลาสเมก้าคิวเราด้วย;-;;;; ค่ตแซด เมก้าคิวคือการที่จะฆ่าอีกฝ่ายครบทั้งทีม แต่เราฆ่าไปสี่ละไง แล้วแบบมันก็ลาสตัวสุดท้าย555 แย่ๆๆๆๆๆ เล่นเสดก็ไปกินข้าว ละแม่งไม่หร่อยเลย ใครมันจะบ้าเอาเส้นสปาเก็ตตี้ไปผัดกับผงมาม่า;-;; (พ่อเราทำนะ) แล้วสักพักก้นึกขึ้นได้ว่า ในPV มีไอนี้อยู่คลิปเรียลที่เทอตัดใหั เลยลังเลว่าจะลบดีไหม ในใจอะไม่อยากลบแต่มันมีเธอด้วยไง ก็เลยแบบทักไปถามดีไหม แต่ก็ตั้งใจว่าจะไม่ทักทั้งวัน แต่สุดท้ายก็ทัก5555 ละเปลี่ยนใจเลยลบข้อความ แต่เทอดันเห็น;-; ก็อืมไม่ลบเรียลดีกว่า555 แล้วต่อมาตอนเกือบๆบ่ายสาม เทอก็ทักมา ค่ตดีใจ555 แล้วก็คุยกันได้แบบปกติละมั้ง ไม่ดิมันเป็นการยื้อเทอมากกว่า;-; แต่ก็ดีใจที่เทอบอกว่ามีโอกาสคบกัน20% ถึงจะแค่20% มันก้ไม่ใช่0ไง เลยแบบมีความตั้งใจเพิ่มขึ้นเลย555 หลังจากนั้นก็ทำงานบ้านยาวๆๆๆๆๆ แล้วก็ตอนแรก เราก็กลัวเทออึดอัด+ เกลียดเรา  ตามสไตล์เราแต่ใจมันก็ไม่ยอมอะ เลยแบบ ต้องการคนมาห้าม สรุปไม่มีใครห้าม คนที่บอกว่าเราก็บอกว่าไม่ได้ห้ามขนาดนั้น ทุกคนก็บอกสไตล์เดียวกันว่า เทอจะอึดอัดหรือเกลียดเราได้นะ มันก็เลยจะลืมเลิกความคิดละเพราะคนที่พูดคือคนที่รู้ใจเทอมากที่สุด ละกัทักไปขอโทษเทอบลาๆๆ หลัวจากนั้นก็คุยกันชะ แล้วก็โทร เอาจริงมะหลังโทรเสดเราก้ยังไม่รู้เลยว่า จะจีบต่อหรือพอ555 ไม่รู้ว่าที่เทอพูดมาจากใจจริง หรือแค่ต้องการเซฟความรู้สึก ค่อยๆคิดละกัน จะใช้อารมณ์ให้น้อยที่สุด นอนดีกว่าไปละๆๆๆ ฝันดีนะครับคนเก่ง'

},
{
    id: 2,
    day: '19/12/65',
    name: 'fa-solid fa-face-laugh-squint',
    detail: 'hi',
    description:'หวัดดี~~ ตื่นมาก้เครียดเลย ไมร่าให้เราสอนคณิต ที่ส่งให้เทออะ ซึ่งเราทำมิเปน;-;;;; อาบน้ำปกติ แต่อากาศค่ตหนาวววว ฝนตกก็ยังมิหยุด ตอนจะไปรอรถสวน แม่ก็เลยให้เราใส่เสื้อฝนไป แต่ก้เปียกอยู่ดี;-; เปียกตอนที่เดินมาจากที่จอดรถไปรร. มาถึงก้ไปซื้อหนมปังกับ นมกิน สุดท้ายก็ไม่หมด มันเอียน;-;; เห็นเทอตอนมานะ แต่แจ๊นบอกว่าให้ไปเข้าแถวก่อน ก็เลยเดินไปคนเดียว แล้วก็เข้าแถวเสด ก้อยากไปนั่งที่โต๊ะนะ แต่ก็กลัว~ ก้เลยเดินไปเดินมาอยู่อย่างงั้นสักพัก แล้วก้เดินขึ้นห้อง ตอนเรียนก้ค่ตแย่ สูตรเยอะชิบหายตาลาย;-;;;; แต่ตกใจที่เทอส่ง locket มาให้ อึังแบบอึังเลย จบคาบก็ชิวๆ ปล่อยใจเหมือนเดิม แล้วก็เรียนสังคมจารก็บอกแนวข้อสอบบลาๆๆๆๆ จบไปก้คาบคณิต จารไม่อยู่แหละ เลยนั่งไปสักพัก แล้วก็มีคนมาถามเรื่องของเทอ สรุปเราร้อง;-;;;; แย่ๆๆๆ กินข้าวก็ไม่มีไรมากจากนั้น ไม่รู้จะไปอยู่ไหน เลยเดินตามแม้กไปเรื่อยๆๆๆๆ แล้วก็นึกขึ้นได้ ว่าไปเอาเงินที่เทอ จากนั้นไปเอาเงิน ตอนแรกก็มิคิดไร แล้วสักพักพอนับมันก้เกิน 395 เลยหงิดนิดนึง ละลงเอาไปคืนเทอ ตอนแรกเทอก้จะไม่เอาอีกเลย-_- ละปฎิเสธบลาๆๆๆ ละเทอก็คืนบางอย่างมาให้สิ่งที่เราไม่คาดคิด เราลืมไปละว่าให้เทอยืม;-; จากนั้นก้เอามาละกัขึ้นห้องไปเขียนเว็ปนี้แหละ คาบชีวะจารมิอยู่มันเลยว่าง ทั้งคาบนั้นแม้กเปิดเพลงอกหัก ทั้งคาบ ละก็มีแต่คนด่าเรา;-; บอกว่าเราไม่ยอมรับความจริง ซึ่งมันก้จริงแหละ555 แล้วไงเทอเกลียดเรายังดีกว่าเราตอบกลับไปแบบนั้น ทุกคนก้อึ้ง เพราะเราแปลกมั้ง แล้วก็ด่าๆๆต่อ วันนี้มีแต่คนห้ามให้เรามานั่งกับเทอ ละก็ เข้าใกล้เทอ ค่ตเส้า;-;; คาบeng สอบชะ เราก็ยอมรับว่าเราลอก;-; แต่ก็ทำไมได้เพราะลืมคำตอบ เลยปล่อยใจ แต่แจ๊นก้ยื่นกระดาษ ที่เขียนคำแปลศัพท์ให้แล้วจากนั้นก้ แก้ยาวๆ สอบเสดก้เดินมาอาคารหกเลย แล้วจารอกม. ก้พูดเรื่องโครงงานบลาๆ รำคาญนิดๆนะ แล้วก็ไปช่วยโครงงานกลุ่มแจ๊น จากนั้นเรียนเสด ก้แบบมาทำการงานต่อ แล้วก็มานั่งกับเทอ ตอนแรกเราก็ไม่กล้านนั่งโต๊ะเดียวกันกับเทอหรอก จนทุกคนไปหมด ถึงจะกล้านั่ง ละก็กลัวเทออึดอัดด้วย เทอไปตอนสี่ครึ่งชะ สักพักรถสวนเราก้โทรมาเลย;-; วันนี้รถมาค่ตเร็ว กลับบ้านชะ ระหว่างกับก้คุยกันเทอ คุยไปเรื่อยๆ เรื่องเดิมๆเทอจะเบื่อไหมก้ไม่รู้ จนมาถึงตอนนึงที่เทอบอกว่าคำพูดของเรามันจะลดคุณค่าตัวเรา เราเลยแบบเออก้จริง เทอบอกด้วยนิว่าชอบคนที่มีคุณค่า ทั้งตัวเองแล้วก็คนอื่น ก็เลยปรับความคิดละก็ ตั้งเป้าหมายว่า ตอนอยู่รร. จะไปหาเทอให้น้อยที่สุด จะไม่พูดเรื่องขอคบแล้ว แล้วก้จะทักเทอตอนกลางคืนทุกวันเลย ต่อมาแม่เทอก็ลงสตอรี่ชะ ตั้งใจเขียนให้แม่เทอไม่รู้แต่เธอต้องรู้ว่าเป็นตัวเอง ละพอแม่เทอบอกว่าน่ารักดี เราค่ตดีใจ555 เลยแบบลงมั้งดีกว่า หวังให้เทอพิมมาหาเราบ้างนะ แล้วก็ง่วงนอนเลยบอกฝันดีเทอเลย ฝันดีนะครับคนเก่ง ถ้าเข้ามาอ่านแล้ว ตอบเราบ้างก้ได้นะ55555 ไปละ'

},
{
    id: 3,
    day: '20/12/65',
    name: 'fa-solid fa-face-laugh-squint',
    detail: 'hi',
    description:'ตื่นเช้ามาก็เปิดไอจีเลย สรุปเทอก็ไม่พิมมา;-;;; ถ้าให้พูดตรงๆ มันก็เส้าแหละเราคาดหวังให้เธอพิมมาให้ แต่ไม่เป็นไรครั้งหน้าต้องทำให้เทอพิมมาให้ได้ :) ไปอาบน้ำละ ชีวะ จารบอกคะแนนละ ได้8.5 เต็ม 20 ;-;;;;; ตั้งใจทำแล้วแท้ๆแย่จัด ก้อยากพูดว่าครั้งหน้าเอาไหม แต่ก็เส้าอะ ชิวๆแจ๊นก้ตกเหมือนกัน555 เลยมิค่อยเครียดเท่าไหร่ละ อยากอวดคะแนนจางงงง พูดดีไหมคืนนี้ เดะค่อยพูดละกันน ระหว่างเรียนชีวะจารไม่ฟังเราเลย~~ แต่ก้ไม่ซีเพราะยังไงก็เป็นแบบนี้ตลอดชินละ555 เรียนเสดก้ไปเรียนพระพุทธต่อ ไม่มีไรมาก มีแต่จารบอกว่าสอบ;-;;;;; ค่ตแย่ๆๆๆๆๆ มีไรให้สอบวะ;-; เอ้อมีไอนั้นด้วยตอนแม้กพรีงานอะมันหัวเราะเว้ย ละแบบจารหัวร้อนเลยว่ามันหัวเราะอะไร555 หัวเราะจนหน้าแดงอะ เรียนเสดก้ลงมากินข้าว ก็เจอเทอด้วยแต่ทำเปนมิเห็น แล้วก็ระหว่างที่เดินไปเอางานกับแม็กที่อ.6 เราก้มองเทอนะ ตอนนั้นเทอทำENG อยู่มั้งเลยไม่อยากไป เลยขึ้นห้องไปทำงานคอม ขึ้นมาก้เจอจารฐิติ ก็คุยกับจารเรื่องคอมยาวๆๆๆ จนคาบเลยไป10นาที5555 แล้วจารก็สอบท่องEng โดยการให้แบบเราพูดว่าเราเป็นคนบุคลิกแบบไหน เราก้ตอบไปว่าเปนคนง่ายๆ เพราะไม่คิดไรเยอะ;-; มาคาบคณิตก้ค่ตน่าเบื่อ อยากไปหาเทอละ แต่ก้ทำมิได้ อยากไปโว้ยยยย5555 ไม่ได้ๆต้องห้ามใจๆ อ๊ะ เดะมีสอบคอมนี้หว่าแต่ช่างมันชิวๆ เปิดเน็ตได้ สอบเสดกัไม่มีไรมาก ยอมรับว่าเปิดเน็ตทั้งหมด;-: แล้วก้นั่งเล่นกับนัดจนถึง16.30 ละก็กลับบ้าน กลับมาก็ทักหาเทอต่อ ละก็เปลี่ยนใจเลยลบข้อความแต่เธอกลับเห็นอึังนิดๆอะ;-; แล้วก็ไปอาบน้ำกินข้าวบลาๆๆ จนถึง19.00 ก็ส่งคลิปสอนคอมไปให้เพื่อน แล้วก็เกือบๆสามทุ่มก็สอนส่วนตัวให้แจ๊น ผ่านแจ๊นละก้ระหว่างที่สอน กรีนทีมันมากวนอะ;-;;;แย่ๆๆ สอนเสดสี่ทุ่มกว่าๆ ละก้ไปนอนเลย ฝันดีนะครับวันนี้ไม่ค่อยมีไรเลย;-;; เอ้อก่อนไป เราหึงเทอด้วยนะแบบมีคนมาชอบเยอะเกิ้นน แต่ก็ไม่มีสิทธิ์หึงที;-;'

}
];

// import { product } from './firebase.js';


$(document).ready(() => {
    var html = '';
    for (let i = 0; i < product.length; i++) {
        html += `<div onclick="openProductDetail(${i})" class="box-detail-card">
                    <div class="day-bar">
                    <p >${product[i].day}</p>
                    </div>
                    <div class="icon-bar">
                    <i class="${product[i].name} icon"></i>
                    </div>
                </div>`;
    }
    $("#diray-list").html(html);

})



function closeModal() {
    $(".modal").css('display','none')
}
var productindex = 0;

function openProductDetail(index) {
    productindex = index;
    console.log(productindex)
    $("#modalDesc").css('display', 'flex')
    $("#mdd-name").text(product[index].day);
    $("#mdd-desc").text(product[index].description);
   
}


