var product = [{
    id: 1,
    day: '18/12/65',
    name: 'fa-solid fa-face-sad-cry',
    detail: 'hi',
    description:'ไง วันแรกของการเป็นพี่น้อง;-; กะทันหันชิบ พึ่งบอกไมร่าเองว่า"เราไม่มีความคิดว่าจะเลิกกับแตม เราแค่แบบ อยากทำให้ความสัมพันธ์ในตอนนี้ ให้มันดีขึ้นไป" แต่ช่างเถอะทำตัวเองล้วนๆ55555 แต่ก็นะที่ผ่านมาไมร่าแนะนำเราเยอะมากกก แต่เพราะเราอีโก้สูงมั้ง เลยทำให้ไม่ฟัง เมื่อคืนก็นอนไม่หลับเลยแบบสะดุ้งตื่นเกือบทุกชม.อะ555 ตื่นมาก็หกโมงกว่าๆ แล้วก็ถามแจ๊นว่า เราจะสามารถเปลี่ยนตัวเองแล้วจีบเทอได้อีกหรือป่าว ส่วนคำตอบก้ไม่ แจ๊นตอบมาประมาณแปดโมงนิดๆ หลังจากนั้นก็โทรคุยกันสักพักเลย พอวางสายปุ๊บ ก็ไปโพสต์รูปในPV สักพักเทอกดใจให้โคตรๆๆๆๆๆดีใจ555 แล้วก็ทักไปหาเซินต่อ ก็แบบช่วยเล่นเกม ละคุยกันได้ เราโดนด่ายับเลย5555 เล่นกันตอนสิบโมง ถึง สิบเอ็ดโมง ไอเชี่ยนั้น ลาสเมก้าคิวเราด้วย;-;;;; ค่ตแซด เมก้าคิวคือการที่จะฆ่าอีกฝ่ายครบทั้งทีม แต่เราฆ่าไปสี่ละไง แล้วแบบมันก็ลาสตัวสุดท้าย555 แย่ๆๆๆๆๆ เล่นเสดก็ไปกินข้าว ละแม่งไม่หร่อยเลย ใครมันจะบ้าเอาเส้นสปาเก็ตตี้ไปผัดกับผงมาม่า;-;; (พ่อเราทำนะ) แล้วสักพักก้นึกขึ้นได้ว่า ในPV มีไอนี้อยู่คลิปเรียลที่เทอตัดใหั เลยลังเลว่าจะลบดีไหม ในใจอะไม่อยากลบแต่มันมีเธอด้วยไง ก็เลยแบบทักไปถามดีไหม แต่ก็ตั้งใจว่าจะไม่ทักทั้งวัน แต่สุดท้ายก็ทัก5555 ละเปลี่ยนใจเลยลบข้อความ แต่เทอดันเห็น;-; ก็อืมไม่ลบเรียลดีกว่า555 แล้วต่อมาตอนเกือบๆบ่ายสาม เทอก็ทักมา ค่ตดีใจ555 แล้วก็คุยกันได้แบบปกติละมั้ง ไม่ดิมันเป็นการยื้อเทอมากกว่า;-; แต่ก็ดีใจที่เทอบอกว่ามีโอกาสคบกัน20% ถึงจะแค่20% มันก้ไม่ใช่0ไง เลยแบบมีความตั้งใจเพิ่มขึ้นเลย555 หลังจากนั้นก็ทำงานบ้านยาวๆๆๆๆๆ แล้วก็ตอนแรก เราก็กลัวเทออึดอัด+ เกลียดเรา  ตามสไตล์เราแต่ใจมันก็ไม่ยอมอะ เลยแบบ ต้องการคนมาห้าม สรุปไม่มีใครห้าม คนที่บอกว่าเราก็บอกว่าไม่ได้ห้ามขนาดนั้น ทุกคนก็บอกสไตล์เดียวกันว่า เทอจะอึดอัดหรือเกลียดเราได้นะ มันก็เลยจะลืมเลิกความคิดละเพราะคนที่พูดคือคนที่รู้ใจเทอมากที่สุด ละกัทักไปขอโทษเทอบลาๆๆ หลัวจากนั้นก็คุยกันชะ แล้วก็โทร เอาจริงมะหลังโทรเสดเราก้ยังไม่รู้เลยว่า จะจีบต่อหรือพอ555 ไม่รู้ว่าที่เทอพูดมาจากใจจริง หรือแค่ต้องการเซฟความรู้สึก ค่อยๆคิดละกัน จะใช้อารมณ์ให้น้อยที่สุด นอนดีกว่าไปละๆๆๆ ฝันดีนะครับคนเก่ง'

}
];

$(document).ready(() => {
    var html = '';
    for (let i = 0; i < product.length; i++) {
        html += `<div onclick="openProductDetail(${i})" class="box-detail-card">
                    <div class="day-bar">
                    <p >${product[i].day}</p>
                    </div>
                    <div class="icon-bar">
                    <i class="${product[i].name} icon"></i>
                    </div>
                </div>`;
    }
    $("#diray-list").html(html);

})



function closeModal() {
    $(".modal").css('display','none')
}
var productindex = 0;

function openProductDetail(index) {
    productindex = index;
    console.log(productindex)
    $("#modalDesc").css('display', 'flex')
    $("#mdd-name").text(product[index].day);
    $("#mdd-desc").text(product[index].description);
   
}